-- 2016.08.19 DDL, 제약조건 활용 테이블 생성하기
/*
                    판매전표
   ===================================================
    컬럼명      전표번호    판매일자     고객명      총액
   ===================================================
    P|U|N       PK         NN         NN
   ===================================================
    참조테이블
   ===================================================
    참조 컬럼
   ===================================================
    CHECK                                      > 0
   ===================================================
    타입        VARCHAR2   DATE    VARCHAR2    NUMBER
   ===================================================
    길이           12                 34
   ===================================================
*/

CREATE TABLE 판매전표(
  전표번호 VARCHAR2(12) CONSTRAINT 판매전표_전표번호_PK PRIMARY KEY,
  판매일자 DATE CONSTRAINT 판매전표_판매일자_NN NOT NULL,
  고객명 VARCHAR2(34) CONSTRAINT 판매전표_고객명_NN NOT NULL,
  총액 NUMBER CONSTRAINT 판매전표_총액_CK CHECK(총액 > 0)
);

SELECT * FROM 판매전표;

/*
  형식)
    1) 제약조건에 이름을 부여하는 방법
    ==>   [컬럼명] [데이터타입] CONSTRAIN [제약조건이름] [제약조건]
    ==> Ex)
          전표번호 VARCHAR2(20) CONSTRAIN 판매전표_전표번호_NN NOT NULL

    2) 제약조건을 맨 뒤에 주는 방법
    ==>   CONSTRAIN [제약조건이름] [제약조건](컬럼명)
    ==> Ex)
          CREATE TABLE 판매전표(
            전표번호 VARCHAR2(12),
            판매일자 DATE CONSTRAIN 판매전표_판매일자_NN NOT NULL,
            CONSTRAIN 판매전표_전표번호_PK PRIMARY KEY(전표번호)
          );
*/

/*
                    제 품
  ==========================================
   컬럼명    제품번호      제품명       제품단가
  ==========================================
   P/U/K     PK          UK
  ==========================================
   참조테이블
  ==========================================
   참조컬럼
  ==========================================
   CHECK                              >0
  ==========================================
   타입    VARCHAR2    VARCHAR2     NUMBER
  ==========================================
   길이       12            12
  ==========================================
*/

CREATE TABLE 제품(
  제품번호 VARCHAR2(12) CONSTRAINT 제품_제품번호_PK PRIMARY KEY,
  제품명 VARCHAR2(12) CONSTRAINT 제품_제품번호_UK UNIQUE,
  제품단가 NUMBER(5) CONSTRAINT 제품_제품단가_CK CHECK(제품단가>0)
);

SELECT * FROM 제품;

/*
                 전표상세
  =========================================================
   컬럼명    전표번호      제품번호       수량     단가     금액
  =========================================================
   P/U/K      PK          NN          NN      NN
  =========================================================
   참조테이블 판매전표       제품
  =========================================================
   참조컬럼   전표번호      제품번호
  =========================================================
   CHECK                                               >0
  =========================================================
   타입     VARCHAR2     VARCHAR2    NUMBER  NUMBER  NUMBER
  =========================================================
   길이       12            12
  =========================================================
*/

CREATE TABLE 전표상세(
  전표번호 VARCHAR2(12) CONSTRAINT 전표상세_전표번호_PK PRIMARY KEY REFERENCES 판매전표(전표번호),
  제품번호 VARCHAR2(12) CONSTRAINT 전표상세_전표번호_NN NOT NULL REFERENCES 제품(제품번호),
  수량 NUMBER(5) CONSTRAINT 전표상세_수량_NN NOT NULL,
  단가 NUMBER(5) CONSTRAINT 전표상세_단가_NN NOT NULL,
  금액 NUMBER(5) CONSTRAINT 전표상세_금액_CK CHECK(금액>0)
);

SELECT * FROM 전표상세;