-- 2016.08.19 DDL, 제약조건 활용 테이블 생성하기
/*
                    판매전표
   ===================================================
    컬럼명      전표번호    판매일자     고객명      총액
   ===================================================
    P|U|N       PK         NN         NN
   ===================================================
    참조테이블
   ===================================================
    참조 컬럼
   ===================================================
    CHECK                                      > 0
   ===================================================
    타입        VARCHAR2   DATE    VARCHAR2    NUMBER
   ===================================================
    길이           12                 34
   ===================================================
*/

CREATE TABLE 판매전표(
  전표번호 VARCHAR2(12) CONSTRAINT 판매전표_전표번호_PK PRIMARY KEY,
  판매일자 DATE CONSTRAINT 판매전표_판매일자_NN NOT NULL,
  고객명 VARCHAR2(34) CONSTRAINT 판매전표_고객명_NN NOT NULL,
  총액 NUMBER CONSTRAINT 판매전표_총액_CK CHECK(총액 > 0)
);

SELECT * FROM 판매전표;

/*
  형식)
    1) 제약조건에 이름을 부여하는 방법
    ==>   [컬럼명] [데이터타입] CONSTRAIN [제약조건이름] [제약조건]
    ==> Ex)
          전표번호 VARCHAR2(20) CONSTRAIN 판매전표_전표번호_NN NOT NULL

    2) 제약조건을 맨 뒤에 주는 방법
    ==>   CONSTRAIN [제약조건이름] [제약조건](컬럼명)
    ==> Ex)
          CREATE TABLE 판매전표(
            전표번호 VARCHAR2(12),
            판매일자 DATE CONSTRAIN 판매전표_판매일자_NN NOT NULL,
            CONSTRAIN 판매전표_전표번호_PK PRIMARY KEY(전표번호)
          );
*/